# Flask — это микрофреймворк для Python,
# созданный в 2010 году разработчиком по имени Армин Ронахер.
#
# Пристава «микро» говорит о том, что Flask действительно маленький.
# У него в комплекте нет ни набора инструментов, ни библиотек,
# которыми славятся другие популярные фреймворки.
# Но он создан с потенциалом для расширения.
#
# Во фреймворке есть набор базовых возможностей, а расширения отвечают за все остальное.
# «Чистый» Flask не умеет подключаться к базе данных, проверять данные формы,
# загружать файлы и так далее. Для добавления этих функций нужно использовать расширения.
# Это помогает использовать только те из них, которые на самом деле нужны.
#
# При этом Flask не такой жесткий в отношении того,
# как разработчик должен структурировать свою программу.
# Он отлично подходит для освоения веб-разработки.
