TASKS = [
    {'name': 'Главная', 'desc': 'Пустышка для соблюдения очередности заданий по индексам.'},
    {'name': 'Задание 1', 'desc': 'Создать страницу, на которой будет кнопка "Нажми меня", при нажатии на которую '
                                  'будет переход на другую страницу с приветствием пользователя по имени.'},
    {'name': 'Задание 2', 'desc': 'Создать страницу, на которой будет изображение и ссылка на другую страницу, '
                                  'на которой будет отображаться форма для загрузки изображений.'},
    {'name': 'Задание 3', 'desc': 'Создать страницу, на которой будет форма для ввода логина и пароля. '
                                  'При нажатии на кнопку "Отправить" будет произведена проверка '
                                  'соответствия логина и пароля '
                                  'и переход на страницу приветствия пользователя или страницу с ошибкой.'},
    {'name': 'Задание 4', 'desc': 'Создать страницу, на которой будет форма для ввода текста и кнопка "Отправить". '
                                  'При нажатии кнопки будет произведен подсчет количества слов в тексте '
                                  'и переход на страницу с результатом.'},
    {'name': 'Задание 5', 'desc': 'Создать страницу, на которой будет форма для ввода двух чисел и выбор операции '
                                  '(сложение, вычитание, умножение или деление) и кнопка "Вычислить". '
                                  'При нажатии на кнопку будет произведено вычисление результата выбранной операции '
                                  'и переход на страницу с результатом.'},
    {'name': 'Задание 6', 'desc': 'Создать страницу, на которой будет форма для ввода имени и возраста пользователя '
                                  'и кнопка "Отправить". '
                                  'При нажатии на кнопку будет произведена проверка возраста '
                                  'и переход на страницу с результатом или на страницу с ошибкой '
                                  'в случае некорректного возраста.'},
    {'name': 'Задание 7', 'desc': 'Создать страницу, на которой будет форма для ввода числа и кнопка "Отправить". '
                                  'При нажатии на кнопку будет произведено перенаправление на страницу с результатом, '
                                  'где будет выведено введенное число и его квадрат.'},
    {'name': 'Задание 8', 'desc': 'Создать страницу, на которой будет форма для ввода имени и кнопка "Отправить". '
                                  'При нажатии на кнопку будет произведено перенаправление на страницу '
                                  'с flash сообщением, '
                                  'где будет выведено "Привет, {имя}!".'},
    {'name': 'Задание 9', 'desc': 'Создать страницу, на которой будет форма для ввода имени и электронной почты. '
                                  'При отправке которой будет создан cookie файл с данными пользователя. '
                                  'Также будет произведено перенаправление на страницу приветствия, '
                                  'где будет отображаться имя пользователя. '
                                  'На странице приветствия должна быть кнопка "Выйти". '
                                  'При нажатии на кнопку будет удален cookie файл с данными пользователя '
                                  'и произведено перенаправление на страницу ввода имени и электронной почты.'},
]
